python/08.class.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-02-09 Sat 21:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>类</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
</head>
<body>
<div id="content">
<h1 class="title">类</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org86d2641">1. 定义类</a></li>
<li><a href="#orgfb4b17e">2. 类继承</a></li>
<li><a href="#org86436d5">3. 访问控制</a></li>
<li><a href="#org3fffbd1">4. 定义类型类</a></li>
</ul>
</div>
</div>


<div id="outline-container-org86d2641" class="outline-2">
<h2 id="org86d2641"><span class="section-number-2">1</span> 定义类</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">class</span> <span style="color: #268bd2;">Vector</span>:
    <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">constructor</span>
    <span style="color: #859900;">def</span> <span style="color: #b58900;">__init__</span><span style="color: #8d5649;">(</span><span style="color: #859900;">self</span>, a, b<span style="color: #8d5649;">)</span>:
        <span style="color: #859900;">self</span>.a = a
        <span style="color: #859900;">self</span>.b = b

    <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">destructor</span>
    <span style="color: #859900;">def</span> <span style="color: #b58900;">__del__</span><span style="color: #8d5649;">(</span><span style="color: #859900;">self</span><span style="color: #8d5649;">)</span>:
        <span style="color: #859900;">pass</span>

    <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">displayer of this class</span>
    <span style="color: #859900;">def</span> <span style="color: #b58900;">__str__</span><span style="color: #8d5649;">(</span><span style="color: #859900;">self</span><span style="color: #8d5649;">)</span>:
        <span style="color: #859900;">return</span> <span style="color: #2aa198;">'Vector (%d, %d)'</span> % <span style="color: #8d5649;">(</span><span style="color: #859900;">self</span>.a, <span style="color: #859900;">self</span>.b<span style="color: #8d5649;">)</span>

    <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">override operator '+'</span>
    <span style="color: #859900;">def</span> <span style="color: #b58900;">__add__</span><span style="color: #8d5649;">(</span><span style="color: #859900;">self</span>,other<span style="color: #8d5649;">)</span>:
        <span style="color: #859900;">return</span> Vector<span style="color: #8d5649;">(</span><span style="color: #859900;">self</span>.a + other.a, <span style="color: #859900;">self</span>.b + other.b<span style="color: #8d5649;">)</span>

<span style="color: #6c71c4;">v1</span> = Vector<span style="color: #8d5649;">(</span>2,10<span style="color: #8d5649;">)</span>
<span style="color: #6c71c4;">v2</span> = Vector<span style="color: #8d5649;">(</span>5,-2<span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>v1 + v2<span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
Vector (7, 8)

</pre>
</div>
</div>


<div id="outline-container-orgfb4b17e" class="outline-2">
<h2 id="orgfb4b17e"><span class="section-number-2">2</span> 类继承</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">__metaclass__</span> = <span style="color: #6c71c4;">type</span>
<span style="color: #859900;">class</span> <span style="color: #268bd2;">Parent</span>:
    <span style="color: #859900;">def</span> <span style="color: #b58900;">__init__</span><span style="color: #8d5649;">(</span><span style="color: #859900;">self</span>,<span style="color: #8d5649;">)</span>:
      <span style="color: #859900;">self</span>.name = <span style="color: #2aa198;">'parent'</span>

    <span style="color: #859900;">def</span> <span style="color: #b58900;">myMethod</span><span style="color: #8d5649;">(</span><span style="color: #859900;">self</span><span style="color: #8d5649;">)</span>:
        <span style="color: #859900;">print</span><span style="color: #8d5649;">(</span><span style="color: #859900;">self</span>.name<span style="color: #8d5649;">)</span>

<span style="color: #859900;">class</span> <span style="color: #268bd2;">Child</span><span style="color: #8d5649;">(</span>Parent<span style="color: #8d5649;">)</span>:
    <span style="color: #859900;">def</span> <span style="color: #b58900;">__init__</span><span style="color: #8d5649;">(</span><span style="color: #859900;">self</span><span style="color: #8d5649;">)</span>:
      <span style="color: #859900;">self</span>.name = <span style="color: #2aa198;">'child'</span>

    <span style="color: #859900;">def</span> <span style="color: #b58900;">myMethod</span><span style="color: #8d5649;">(</span><span style="color: #859900;">self</span><span style="color: #8d5649;">)</span>:
        <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">call super method</span>
        <span style="color: #6c71c4;">super</span><span style="color: #8d5649;">(</span>Child, <span style="color: #859900;">self</span><span style="color: #8d5649;">)</span>.myMethod<span style="color: #8d5649;">()</span>

<span style="color: #6c71c4;">c</span> = Child<span style="color: #8d5649;">()</span>
c.myMethod<span style="color: #8d5649;">()</span>
</pre>
</div>

<pre class="example">
child

</pre>
</div>
</div>


<div id="outline-container-org86436d5" class="outline-2">
<h2 id="org86436d5"><span class="section-number-2">3</span> 访问控制</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">class</span> <span style="color: #268bd2;">Visibility</span>:
    <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">private method start with __</span>
    <span style="color: #859900;">def</span> <span style="color: #b58900;">__inaccessible</span><span style="color: #8d5649;">(</span><span style="color: #859900;">self</span><span style="color: #8d5649;">)</span>:
        <span style="color: #859900;">print</span> <span style="color: #2aa198;">'you can not see me'</span>

    <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">public method</span>
    <span style="color: #859900;">def</span> <span style="color: #b58900;">accessible</span><span style="color: #8d5649;">(</span><span style="color: #859900;">self</span><span style="color: #8d5649;">)</span>:
        <span style="color: #859900;">print</span> <span style="color: #2aa198;">'this secret message is:'</span>,
        <span style="color: #859900;">self</span>.__inaccessible<span style="color: #8d5649;">()</span>


<span style="color: #6c71c4;">secr</span> = Visibility<span style="color: #8d5649;">()</span>
<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">secr.__inaccessible()</span>
<span style="color: #d33682;">'''</span>
<span style="color: #d33682;">Traceback (most recent call last):</span>
<span style="color: #d33682;">  File "***.py", line 13, in &lt;module&gt;</span>
<span style="color: #d33682;">    secr.__inaccessible()</span>
<span style="color: #d33682;">AttributeError: Visibility instance has no attribute '__inaccessible'</span>
<span style="color: #d33682;">'''</span>
secr.accessible<span style="color: #8d5649;">()</span> <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">&gt;&gt;&gt; this secret message is: you can not see me</span>
</pre>
</div>

<pre class="example">
Traceback (most recent call last):
  File "&lt;stdin&gt;", line 1, in &lt;module&gt;
  File "***.py", line 4
    print 'you can not see me'
                             ^
SyntaxError: Missing parentheses in call to 'print'. Did you mean print('you can not see me')?

</pre>
</div>
</div>


<div id="outline-container-org3fffbd1" class="outline-2">
<h2 id="org3fffbd1"><span class="section-number-2">4</span> 定义类型类</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">__metaclass__</span> = <span style="color: #6c71c4;">type</span>
<span style="color: #859900;">class</span> <span style="color: #268bd2;">Rect</span>:
    <span style="color: #859900;">def</span> <span style="color: #b58900;">__init__</span><span style="color: #8d5649;">(</span><span style="color: #859900;">self</span>, width=0, height=0<span style="color: #8d5649;">)</span>:
        <span style="color: #859900;">self</span>.w = width
        <span style="color: #859900;">self</span>.h = height

    <span style="color: #859900;">def</span> <span style="color: #b58900;">getSize</span><span style="color: #8d5649;">(</span><span style="color: #859900;">self</span><span style="color: #8d5649;">)</span>:
        <span style="color: #859900;">return</span> <span style="color: #859900;">self</span>.w, <span style="color: #859900;">self</span>.h

    <span style="color: #859900;">def</span> <span style="color: #b58900;">setSize</span><span style="color: #8d5649;">(</span><span style="color: #859900;">self</span>, size<span style="color: #8d5649;">)</span>:
        <span style="color: #859900;">self</span>.w, <span style="color: #859900;">self</span>.h = size

    <span style="color: #6c71c4;">size</span> = <span style="color: #6c71c4;">property</span><span style="color: #8d5649;">(</span>getSize, setSize<span style="color: #8d5649;">)</span>

<span style="color: #6c71c4;">r</span> = Rect<span style="color: #8d5649;">(</span>2, 5<span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>r.size<span style="color: #8d5649;">)</span>
<span style="color: #6c71c4;">r.size</span> = 4, 4
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>r.size<span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
(2, 5)
(4, 4)

</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-10-23 Tue 00:00</p>
<p class="author">Author: Jinghui Hu</p>
<p class="date">Created: 2019-02-09 Sat 21:46</p>
</div>
</body>
</html>
